/*
			Лабораторная работа №2.3
			
			
Необходимо разработать программу «Game Over», которая выводит соответ-
ствующую злостную (суровую) надпись на экран монитора с ВНУШИТЕЛЬНЫМ
видом.


*/

import java.lang.*; // импортируем системный класс java для использования объектов in, out, err
import java.util.*;

public class Lab2_3
{  
    public static void main(String args[])
    {
		
    printMessage();            

	}
				
	public static void printMessage(){
		
		System.out.println("=============================================================================");  
		System.out.println(" ######                                                                      ");
		System.out.println("##    ##                                                                     ");
		System.out.println("##        ######  #####  #####  ######     ######  ##     ##  ######  ###### ");
		System.out.println("##  ####       ## ##   ##   ## ##    ##   ##    ##  ##   ##  ##    ## ##   ##");
		System.out.println("##    ##  ####### ##   ##   ## ########   ##    ##   ## ##   ######## ##     ");
		System.out.println("##    ##  ##   ## ##   ##   ## ##         ##    ##    ###    ##       ##     ");
		System.out.println(" ######   ####### ##   ##   ##  #######    ######      #      ####### ##     ");
		System.out.println("=============================================================================");
				
	};
}

